IDEA StatiCa Open Model
ConcreteULSCheckResultInteractionEc2.CheckValueShearTorsionAndBending Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Calculated value of the exploitation of the cross-section (for interaction of shear, torsion and bending) related to the limit value
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double CheckValueShearTorsionAndBending { get; set; }
Public Property CheckValueShearTorsionAndBending As Double
	Get
	Set
public:
property double CheckValueShearTorsionAndBending {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ConcreteULSCheckResultInteractionEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace